---
type: ExtrusionAnalyzer
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# ExtrusionAnalyzer

`Autodesk.Revit.DB.ExtrusionAnalyzer` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CalculateFaceAlignment | 2012 | `public IDictionary < Face , ExtrusionAnalyzerFaceAlignment > CalculateFaceAlignment ()` |
| Method | Create | 2012 | `public static ExtrusionAnalyzer Create ( Solid solidGeometry , Plane plane , XYZ direction )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetExtrusionBase | 2012 | `public Face GetExtrusionBase ()` |
| Property | EndParameter | 2012 | `public double EndParameter { get ; }` |
| Property | ExtrusionDirection | 2012 | `public XYZ ExtrusionDirection { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StartParameter | 2012 | `public double StartParameter { get ; }` |